app/Controllers/Home.php

    public function index()
    {
        $model = new \App\Models\Article();

        $data = [
            'page' => 'index',
            'articles' => $model->paginate(15),
            'pager' => $model->pager,
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `article`