app/Models/Article.php

SELECT COUNT(*) AS `numrows`
FROM `article`
SELECT `id`, `title`, `text`
FROM `article`
ORDER BY `id` ASC
 LIMIT 135, 15
---
    public function findAll($limit = 0, $offset = 0){
        $builder = $this->db->table('article');
        $builder->limit($limit, $offset);
        $builder->select('id, title, text');
        $builder->orderBy('id', 'asc');
        $builder->countAllResults(false);
        $data = $builder->get()->getResultArray();